;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[SawedOff_SA_Shotgun_CV X2WeaponTemplate]
FriendlyName="短管霰弹枪 (T1)"
FriendlyNamePlural="短管霰弹枪"
BriefSummary="作为手枪的替代品，XCOM 神枪手可以选择携带短管霰弹枪。 虽然没有经过适当训练的标准霰弹枪那么致命，但这些武器仍然具有足够的毁灭性，尤其是在近距离使用时。"
TacticalText="<Bullet/> 作为由XCOM 特工改造而成的产物，短管霰弹枪在性能和可靠性上往往各不相同。\n<Bullet/> 在训练有素的神枪手的手中，短管霰弹枪不仅仅是一把手枪。\n<Bullet/> 不同于狙击步枪，短管霰弹枪可以只用一个行动点发射。\n<Bullet/> 神枪手可以多种能力的训练，从而显著提高他们对短管霰弹枪的使用效率。"

[SawedOff_SA_Shotgun_MG X2WeaponTemplate]
FriendlyName="短管霰弹枪 (T2)"
FriendlyNamePlural="短管霰弹枪"
BriefSummary="作为手枪的替代品，XCOM 神枪手可以选择携带短管霰弹枪。 虽然没有经过适当训练的标准霰弹枪那么致命，但这些武器仍然具有足够的毁灭性，尤其是在近距离使用时。"
TacticalText="<Bullet/> 这些短管霰弹枪由标准化的蓝图和更高质量的工艺打造而成，远远超过了它的前身。\n<Bullet/> 短管散弹枪比它们的传统前身要有效得多。\n<Bullet/> 不同于狙击步枪，短管霰弹枪可以只用一个行动点发射。"

[SawedOff_SA_Shotgun_BM X2WeaponTemplate]
FriendlyName="短管霰弹枪 (T3)"
FriendlyNamePlural="短管霰弹枪"
BriefSummary="作为手枪的替代品，XCOM 神枪手可以选择携带短管霰弹枪。 虽然没有经过适当训练的标准霰弹枪那么致命，但这些武器仍然具有足够的毁灭性，尤其是在近距离使用时。"
TacticalText="<Bullet/> 这些按照严格标准制造机械化制造的短管霰弹枪是 XCOM 所能提供的最好的武器之一。\n<Bullet/> 不同于狙击步枪，短管霰弹枪可以只用一个行动点发射。"
